tutorials/heatTransfer/chtMultiRegionFoam/heatExchanger/system/air/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Whether to convert internal faces only (so leave boundary faces intact).
// This is only relevant if your face selection type can pick up boundary
// faces.
internalFacesOnly true;

baffles
{
    baffles
    {
        //- Use predefined faceZone to select faces and orientation.
        type        faceZone;
        zoneName    rotorBlades;

        patches
        {
            master
            {
                name        blades;
                type        wall;
            }
            slave
            {
                $master;
            }
        }
    }
}


// ************************************************************************* //
